app/controllers/admin/contacts_controller.rb

INSERT INTO `contacts` (`created_at`, `updated_at`, `name`, `email`, `user_text`) VALUES ('2020-07-12 03:29:43.039567', '2020-07-12 03:29:43.039567', '花子', 'satoshi5153@gmail.com', 'ga')
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save