app/controllers/tourist/rooms_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM `rooms` WHERE `rooms`.`tourist_id` = 1 ORDER BY `rooms`.`created_at` DESC LIMIT 10 OFFSET 0) subquery_for_count
---
  def index
    @rooms = current_tourist.rooms.order(created_at: :desc).page(params[:page]).per(10)