app/controllers/tourist/searches_controller.rb

  def city
    if @city = params['search']['city']
      city_search_result = City.match(@city)
      binding.pry
      if city_search_result.empty?
        @city_tours = empty
      else
        @city_tours = city.tours.page(params[:page]).per(9)
        @genres = Genre.all
---
SELECT `cities`.* FROM `cities` WHERE ((name LIKE '%%' )) LIMIT 1
SELECT `genres`.* FROM `genres`