app/controllers/tourist/tours_controller.rb

SELECT `genres`.* FROM `genres`
SELECT `tours`.* FROM `tours` LIMIT 9 OFFSET 0
---
  def index
    @genres = Genre.all
    if params[:genre_id]
      @genre = Genre.find(params[:genre_id])
      @tours = @genre.tours.order(created_at: :desc).page(params[:page]).per(10)
    else
      @tours = Tour.all.page(params[:page]).per(9)