app/controllers/tourist/tourists_controller.rb

  def set_tourist
    @tourist = Tourist.find(params[:id])
---
SELECT `tourists`.* FROM `tourists` WHERE `tourists`.`deleted_at` IS NULL AND `tourists`.`id` = 1 ORDER BY `tourists`.`id` ASC LIMIT 1