app/controllers/home/tours_controller.rb

SELECT `tours`.* FROM `tours` WHERE (is_active = 1) LIMIT 9 OFFSET 0
---
  def index
    @tours = Tour.all.page(params[:page]).per(9)