app/controllers/guide/guides_controller.rb

  def show
    @guide = Guide.find(params[:id])
---
SELECT `guides`.* FROM `guides` WHERE `guides`.`deleted_at` IS NULL AND `guides`.`id` = 1 ORDER BY `guides`.`id` ASC LIMIT 1

  def edit
    @guide = Guide.find(params[:id])
---
SELECT `guides`.* FROM `guides` WHERE `guides`.`deleted_at` IS NULL AND `guides`.`id` = 1 ORDER BY `guides`.`id` ASC LIMIT 1

def update
  @guide = Guide.find(params[:id])
  if @guide.update(guide_params)
---
SELECT `guides`.* FROM `guides` WHERE `guides`.`deleted_at` IS NULL AND `guides`.`id` = 1 ORDER BY `guides`.`id` ASC LIMIT 1
UPDATE `guides` SET `guides`.`family_name` = 'ゲスト', `guides`.`name` = 'ガイド', `guides`.`address` = '千葉県市川市田尻4-10-6', `guides`.`postal_code` = '272-0014', `guides`.`phone_number` = '080-1234-1234', `guides`.`introduction` = 'こちらはガイドのゲストユーザーです。FANTRAはフリーで活動しているツアーガイドが運営がバックに立ち、ガイドの信用を可視化することによって顧客を効率的に獲得してもらいたいという思いから作りました。また、観光客ユーザーもよくあるツアーを体験するのではなく、よりローカルな体験を通して貴重な経験をしてもらいたいという思いがあります。', `guides`.`nationality` = '日本', `guides`.`selfy_image_id` = '23f7d45b2c3323cdfdbe6bad1348c4c583378cd90a7db59c16468d06d456', `guides`.`identification_image_id` = '19a1689641b3a521b5d4c3697b1bd59179776eabaac5f781bd2951dcc318', `guides`.`updated_at` = '2020-07-12 03:17:55.816627' WHERE `guides`.`id` = 1