app/controllers/guide/notifications_controller.rb

  def index
    @notifications = current_guide.notifications.page(params[:page]).per(20)
    @notifications.where(checked: false).each do |notification|
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `notifications` WHERE `notifications`.`guide_id` = 1 ORDER BY `notifications`.`created_at` DESC LIMIT 20 OFFSET 0) subquery_for_count
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`guide_id` = 1 AND `notifications`.`checked` = FALSE ORDER BY `notifications`.`created_at` DESC LIMIT 20 OFFSET 0