app/controllers/guide/orders_controller.rb

  def index
    @orders = current_guide.orders
    guide_total_sales = []
    @orders.each do |order|
      guide_total_sales << order.guide_sales
    end
    guide_total_sales_sum = guide_total_sales.sum
    @guide_total_sales = guide_total_sales_sum.floor

    # ステータス毎に画面切替
    order_status_params(params[:order_status])

    # チャット相手のidを入れる。
    rooms = current_guide.rooms
    @tourist_ids = []
    rooms.each do |room|
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`guide_id` = 1 AND `orders`.`created_at` BETWEEN '2020-07-11 15:00:00' AND '2020-07-12 14:59:59.999999'
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`guide_id` = 1