app/controllers/guide/rooms_controller.rb

  def index
    @rooms = current_guide.rooms.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `rooms` WHERE `rooms`.`guide_id` = 1 ORDER BY `rooms`.`created_at` DESC LIMIT 10 OFFSET 0) subquery_for_count