app/controllers/guide/tours_controller.rb

SELECT `genres`.* FROM `genres`
SELECT `tours`.* FROM `tours` ORDER BY `tours`.`created_at` DESC LIMIT 9 OFFSET 0
---
  def index
    @genres = Genre.all
    @news = News.first(7)
    if params[:genre_id]
      @genre = Genre.find(params[:genre_id])
      @tours = @genre.tours.order(created_at: :desc).page(params[:page]).per(9)